app/controllers/parts_controller.rb

    def index
        @parts = Part.all
        @suppliers = Supplier.all
---
SELECT "parts".* FROM "parts"
SELECT "suppliers".* FROM "suppliers"

    def create
        part = Part.new(name: params[:name], number: params[:part_number], price: params[:price], lead_time: params[:lead_time], Supplier: Supplier.find(params[:supplier]), notes: params[:notes])
        if part.valid?
            part.save
---
SELECT  "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "parts" ("name", "number", "price", "lead_time", "Supplier_id", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def show
        @part = Part.find(params[:id])
---
SELECT  "parts".* FROM "parts" WHERE "parts"."id" = ? LIMIT 1  [["id", 1]]