app/controllers/purchase_orders_controller.rb

SELECT "purchase_orders".* FROM "purchase_orders"
---
    def index
        @pos = PurchaseOrder.all