app/controllers/sales_orders_controller.rb

    def index
        @sos = SalesOrder.all
        @suppliers = Supplier.all
        @customers = Customer.all
---
SELECT "sales_orders".* FROM "sales_orders"
SELECT "suppliers".* FROM "suppliers"
SELECT "customers".* FROM "customers"

    def create
        sos = SalesOrder.new(number: params[:number], description: params[:description], opened_date: params[:opened_date], due_date: params[:due_date], customer: Customer.find(params[:customer]))
        if sos.valid?
            sos.save
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "sales_orders" ("number", "created_at", "updated_at") VALUES (?, ?, ?)  [["number", 0], ["created_at", "2018-10-07 21:27:12.579077"], ["updated_at", "2018-10-07 21:27:12.579077"]]