app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "bzuber@wenzlau.com"]]
---
    def process_login
        user = User.find_by(email: params[:email])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
    def dashboard
        @user = User.find(1).name